fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ЗапланированныеОтпуска</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	ПревышениеОтпуска();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковСотрудникПриИзменении(Элемент)
	ПревышениеОтпуска();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	ПревышениеОтпуска();
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПревышениеОтпуска();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЦветВыделения = Новый Цвет(255,0,0);
	ПревышениеОтпуска();
	 РезультатЗапроса = УстановитьПризнакПревышения() ;
		Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		ТекущаяСтрока = Элементы.ОтпускаСотрудников.ТекущаяСтрока;
		ТекущаяСтрока = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	     Строка.ПревышениеОтпуска = Ложь;
	     
		Для Каждого Сотрудник Из РезультатЗапроса Цикл
			Если Строка.Сотрудник = Сотрудник Тогда
				//Элементы.ОтпускаСотрудниковСотрудник.ЦветФона = ЦветВыделения;
				//Элементы.ОтпускаСотрудниковНомерСтроки.ЦветФона = ЦветВыделения;
			Строка.ПревышениеОтпуска = Истина;
		КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаКоличестаДнейОтпуска(Команда)
	ПревышениеОтпуска();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАнализГрафика(Команда) 
    Адрес = ПоместитьВХранилище();
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Адрес", Адрес);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, Элементы.ОтпускаСотрудников,);
КонецПроцедуры

&НаСервере
Функция УстановитьПризнакПревышения() 
	ТЗ = Объект.ОтпускаСотрудников.Выгрузить();
       
	//ТЗ = РеквизитФормыВЗначение("Объект");
	Запрос = Новый Запрос;
    Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
    
    Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТЗ ИЗ &ТЗ КАК ТЗ";
    Запрос.УстановитьПараметр("ТЗ", ТЗ);
    Запрос.Выполнить();
      
		Запрос = Новый Запрос;
	 Запрос.Текст =
	 	"ВЫБРАТЬ
	 	|	РАЗНОСТЬДАТ(ТЗ.ДатаНачала, ТЗ.ДатаОкончания, День) КАК ДнейОтпуска,
	 	|	ТЗ.Сотрудник
	 	|ПОМЕСТИТЬ ВременнаяТаблица1
	 	|ИЗ
	 	|	&ТЗ КАК ТЗ
	 	|;
	 	|
	 	|////////////////////////////////////////////////////////////////////////////////
	 	|ВЫБРАТЬ
	 	|	ВременнаяТаблица1.Сотрудник,
	 	|	СУММА(ВременнаяТаблица1.ДнейОтпуска) КАК ДнейОтпуска
	 	|ИЗ
	 	|	ВременнаяТаблица1 КАК ВременнаяТаблица1
	 	|СГРУППИРОВАТЬ ПО
	 	|	ВременнаяТаблица1.Сотрудник";
	
		 Запрос.УстановитьПараметр("ТЗ", ТЗ);
	 
	 РезультатЗапроса = Новый Массив;
	 Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ДнейОтпуска > 28 Тогда
			РезультатЗапроса.Добавить(Выборка.Сотрудник);
			КонецЕсли;	
		КонецЦикла;
		
	Возврат РезультатЗапроса;
	
КонецФункции

&НаСервере
Функция ПоместитьВХранилище() 
	ТабЗначений = Объект.ОтпускаСотрудников.Выгрузить(); 
	Адрес = ПоместитьВоВременноеХранилище(ТабЗначений);
Возврат Адрес
КонецФункции

 		
   &НаСервере
Процедура ПревышениеОтпуска() 
    ТЗ = Объект.ОтпускаСотрудников.Выгрузить();
       
	//ТЗ = РеквизитФормыВЗначение("Объект");
	Запрос = Новый Запрос;
    Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
    
    Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТЗ ИЗ &ТЗ КАК ТЗ";
    Запрос.УстановитьПараметр("ТЗ", ТЗ);
    Запрос.Выполнить();
      
		Запрос = Новый Запрос;
	 Запрос.Текст =
	 	"ВЫБРАТЬ
	 	|	РАЗНОСТЬДАТ(ТЗ.ДатаНачала, ТЗ.ДатаОкончания, День) КАК ДнейОтпуска,
	 	|	ТЗ.Сотрудник
	 	|ПОМЕСТИТЬ ВременнаяТаблица1
	 	|ИЗ
	 	|	&ТЗ КАК ТЗ
	 	|;
	 	|
	 	|////////////////////////////////////////////////////////////////////////////////
	 	|ВЫБРАТЬ
	 	|	ВременнаяТаблица1.Сотрудник,
	 	|	СУММА(ВременнаяТаблица1.ДнейОтпуска) КАК ДнейОтпуска
	 	|ИЗ
	 	|	ВременнаяТаблица1 КАК ВременнаяТаблица1
	 	|СГРУППИРОВАТЬ ПО
	 	|	ВременнаяТаблица1.Сотрудник";
	
		 Запрос.УстановитьПараметр("ТЗ", ТЗ);
	 
	 РезультатЗапроса = Новый Массив;
	 Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ДнейОтпуска > 28 Тогда
			РезультатЗапроса.Добавить(Выборка.Сотрудник);
			КонецЕсли;	
		КонецЦикла;
		
	//Возврат РезультатЗапроса;
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		ТекущаяСтрока = Элементы.ОтпускаСотрудников.ТекущаяСтрока;
	     Строка.ПревышениеОтпуска = Ложь;
		Для Каждого Сотрудник Из РезультатЗапроса Цикл
			Если Строка.Сотрудник = Сотрудник Тогда
			//	ТекущаяСтрока.
			//	Элементы.ОтпускаСотрудниковНомерСтроки.ЦветФона = Новый Цвет(0,255,0);
			Строка.ПревышениеОтпуска = Истина;
		КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;
КонецПроцедуры
